# წიგნების ცვლადები
books = [
    {"სახელი": "წიგნი1", "ფასი": 100},
    {"სახელი": "წიგნი2", "ფასი": 150},
    {"სახელი": "წიგნი3", "ფასი": 200},
    {"სახელი": "წიგნი4", "ფასი": 250},
    {"სახელი": "წიგნი5", "ფასი": 300},
    {"სახელი": "წიგნი6", "ფასი": 350},
    {"სახელი": "წიგნი7", "ფასი": 400},
    {"სახელი": "წიგნი8", "ფასი": 450},
    {"სახელი": "წიგნი9", "ფასი": 500},
    {"სახელი": "წიგნი10", "ფასი": 550},
]

# 10% ფასდაკლების აღება და დაკარგვა
for book in books[:5]:
    book["ფასი"] *= 0.9

# 20% ფასდაკლების აღება და დაკარგვა
for book in books[5:]:
    book["ფასი"] *= 0.8

# წიგნების დაბეჭდვა
for book in books:
    print(f"{book['სახელი']}: {book['ფასი']} ლარი")
